
&НаСервере
Процедура СтартНаСервере()
	
	Для каждого СтрокаТЧ из Объект.ТЧ Цикл
		Сообщить(
		"Номенклатура: " + СтрокаТЧ.Номенклатура + ", "
		+ "Количество: " + СтрокаТЧ.Количество	
		);
	КонецЦикла; 
	Сообщить("Общее количество строк ТЧ: " + Объект.ТЧ.Количество());  
	
	//Для счетчик = 0 по 10 Цикл
	//	Сообщить(счетчик * 2);
	//КонецЦикла;  
	
	//счетчикПример = 0;
	//Пока счетчикПример < 10 Цикл    
	//	счетчикПример = счетчикПример + 1;
	//	Сообщить(счетчикПример)
	//КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура Старт(Команда)
	СтартНаСервере();
КонецПроцедуры
