
&НаСервере
Процедура СтартНаСервере()
	
	ТЗ = Новый ТаблицаЗначений;
	ТЗ.Колонки.Добавить("Сотрудник");
	ТЗ.Колонки.Добавить("Отдел");
	
	Стр = ТЗ.Добавить();
	Стр.Сотрудник = "Иванов ИИ";
	Стр.Отдел = "Реклама";
	
	Стр = ТЗ.Добавить();
	Стр.Сотрудник = "Петров АА";
	Стр.Отдел = "ИТ";
	
	Стр = ТЗ.Добавить();
	Стр.Сотрудник = "Ольга АА";
	Стр.Отдел = "ИТ";
	
	ОкладСотрудника = Новый описаниеТипов("Число", Новый КвалификаторыЧисла(6, 2));  
	ТЗ.Колонки.Добавить("Оклад", ОкладСотрудника, "Зарплата с учетом копеек");
	ТЗ[0].Оклад = 2050.55;
	ТЗ[1].Оклад = 3040.40;
	ТЗ[2].Оклад = 4090.48;
	
	ТЗ.Свернуть("Отдел", "Оклад");
	ТЗ.Сортировать("Оклад Убыв");
	
	Для каждого СтрокаТЗ из ТЗ Цикл
		Сообщить(
		"Отдел: " + СтрокаТЗ.Отдел
		+ ", ЗП: " + СтрокаТЗ.Оклад
		);	
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура Старт(Команда)
	СтартНаСервере();
КонецПроцедуры
