
&НаСервере
Процедура ЗаполнитьНаСервере()
	
	ДеревоЗначений = РеквизитФормыВЗначение("ДЗ");
	
	КореньУзла = ДеревоЗначений.Строки.Добавить();
	КореньУзла.Страна = "Корень узла";
	
	ПерваяГруппа = КореньУзла.Строки.Добавить();
	ПерваяГруппа.Страна = "Первая группа узла";
	
	ВтораяГруппа = КореньУзла.Строки.Добавить();
	ВтораяГруппа.Страна = "Вторая группа узла";
	
	ПервыйЭлемент = ПерваяГруппа.Строки.Добавить();
	ПервыйЭлемент.Страна = "Первый элемент узла";
	
	ВторойЭлемент = ПерваяГруппа.Строки.Добавить();
	ВторойЭлемент.Страна = "Второй элемент узла";
	
	ЗначениеВРеквизитФормы(ДеревоЗначений, "ДЗ");
	
	//ТекущиеЭлементы = ДЗ.ПолучитьЭлементы();
	//ВыводЭлементовДЗ(ТекущиеЭлементы);
	
КонецПроцедуры

&НаКлиенте
Процедура Заполнить(Команда)
	ЗаполнитьНаСервере();
КонецПроцедуры

Процедура ВыводЭлементовДЗ(ТекущиеЭлементы)
	Для каждого элемент из ТекущиеЭлементы Цикл
		Если элемент.Метка Тогда
			Сообщить(элемент.Страна);
		КонецЕсли;
		
		подЭлементы = элемент.ПолучитьЭлементы();
		колЭлементов = подЭлементы.Количество();
		
		Если ТекущиеЭлементы.Количество() <> 0 Тогда
			ВыводЭлементовДЗ(подЭлементы);
		КонецЕсли
	КонецЦикла 
КонецПроцедуры

&НаКлиенте
Процедура Свернуть(Команда)
	
	ЭлементыФормы = ДЗ.ПолучитьЭлементы();
	СвернутьЭлементыДЗ(ЭлементыФормы); 
	
КонецПроцедуры

&НаКлиенте
Процедура СвернутьЭлементыДЗ(ТекущиеЭлементы)
	Для каждого элемент из ТекущиеЭлементы Цикл
		подЭлементы = элемент.ПолучитьЭлементы();
		колЭлементов = подЭлементы.Количество();
		
		Если колЭлементов <> 0 Тогда
			ИД = элемент.ПолучитьИдентификатор();
			СвернутьЭлементыДЗ(подЭлементы);
			Элементы.ДЗ.Свернуть(ИД);			
		КонецЕсли
	КонецЦикла 
КонецПроцедуры

&НаКлиенте
Процедура Развернуть(Команда)   
	
	ЭлементыФормы = ДЗ.ПолучитьЭлементы();
	РазвернутьЭлементыДЗ(ЭлементыФормы); 
	
КонецПроцедуры

&НаКлиенте
Процедура РазвернутьЭлементыДЗ(ТекущиеЭлементы)
	Для каждого элемент из ТекущиеЭлементы Цикл
		подЭлементы = элемент.ПолучитьЭлементы();
		колЭлементов = подЭлементы.Количество();
		
		Если колЭлементов <> 0 Тогда
			ИД = элемент.ПолучитьИдентификатор();
			РазвернутьЭлементыДЗ(подЭлементы);
			Элементы.ДЗ.Развернуть(ИД);			
		КонецЕсли
	КонецЦикла 
КонецПроцедуры
