
&НаСервере
Процедура СтартНаСервере()
	//Склад = Справочники.Склады.Основной;
	//Сообщить(Склад);
	//
	//НоменклатураНДС = Справочники.Номенклатура.НайтиПоКоду("000000005").НДС;
	//Если НоменклатураНДС = Перечисления.НДС.ПустаяСсылка() Тогда
	//	Сообщить("Не указан НДС");
	//ИначеЕсли НоменклатураНДС = Перечисления.НДС.ЗПБЕЗНДС Тогда
	//	Сообщить("Нет НДС");
	//Иначе 
	//	Сообщить("НоменклатураНДС: " + НоменклатураНДС); 
	//КонецЕсли;             
	
	// Сообщить(ДеньНеделиОпр(5));
	
	//Сч = 100;
	
	//Для Сч = 1 по 3 Цикл
	//	//Сч = Сч - 1;   
	//	Сообщить(Сч);
	//	//Если Сч = 20 Тогда
	//	//	Прервать;
	//	//КонецЕсли;
	//КонецЦикла    
	
	//Выборка = Справочники.Номенклатура.Выбрать();
	//Пока Выборка.Следующий() Цикл
	//	Сообщить(Выборка.Наименование);
	//КонецЦикла;
КонецПроцедуры     

Функция ФункцияЧисло(Параметр)       
	Возврат Параметр * 2;
КонецФункции

Функция ДеньНеделиОпр(День)
	Если День = 1 Тогда
		Возврат "Понедельник"; 
	ИначеЕсли День = 2 Тогда
		Возврат "Вторник";
	ИначеЕсли День = 3 Тогда
		Возврат "Среда";
	ИначеЕсли День = 4 Тогда
		Возврат "Четверг";
	ИначеЕсли День = 5 Тогда
		Возврат "Пятница";
	ИначеЕсли День = 6 Тогда
		Возврат "Суббота";
	ИначеЕсли День = 7 Тогда
		Возврат "Воскресенье";	 
	Иначе
		Возврат "Такого дня нет";
	КонецЕсли;
КонецФункции

&НаКлиенте
Процедура Старт(Команда)
	СтартНаСервере();
КонецПроцедуры
