
&НаКлиенте
Процедура Старт(Команда)
	
	Поле3 = Поле1 + Поле2 + Объект.Поле4;
	Если Поле3 < 15 Тогда
		Элементы.Поле4.Видимость = Ложь;
	Иначе 
		Элементы.Поле4.Видимость = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПереключательПриИзменении(Элемент)
	
	Если Объект.Переключатель = 1 Тогда
		Поле1 = 10;
	ИначеЕсли Объект.Переключатель = 2 Тогда
		Поле2 = 20;
	ИначеЕсли Объект.Переключатель = 3 Тогда
		Поле3 = 0;		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура НашФлагПриИзменении(Элемент)
	
	Если Объект.НашФлаг = Истина Тогда
		Элементы.Группа1.Доступность = Ложь;
		//Элементы.Поле1.Доступность = Ложь;
		//Элементы.Поле2.Доступность = Ложь;
		//Элементы.Поле3.Доступность = Ложь;
		//Элементы.Поле4.Доступность = Ложь;
	Иначе                            
		Элементы.Группа1.Доступность = Истина;
		//Элементы.Поле1.Доступность = Истина;
		//Элементы.Поле2.Доступность = Истина;
		//Элементы.Поле3.Доступность = Истина;
		//Элементы.Поле4.Доступность = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьНаСервере()
	
	ТЗ = Новый ТаблицаЗначений;
	ТЗ.Колонки.Добавить("Товар");
	ТЗ.Колонки.Добавить("Цена");
	ТЗ.Колонки.Добавить("Ед");
	ТЗ.Колонки.Добавить("Количество");
	
	РНД = Новый ГенераторСлучайныхЧисел(2000);	
	
	Номенклатура = Справочники.Номенклатура.Выбрать();
	Пока Номенклатура.Следующий() Цикл
		Если Не Номенклатура.ЭтоГруппа Тогда 
			Стр = ТЗ.Добавить();
			
			Элем = Номенклатура.Ссылка;
			Стр.Товар = Элем;
			
			РНД_Количество = РНД.СлучайноеЧисло(2, 10);
			Стр.Количество = РНД_Количество;                       
			
			РНД_Цена = РНД.СлучайноеЧисло(2100, 4000);
			Стр.Цена = РНД_Цена;     
			
			Стр.Ед = Номенклатура.ЕдиницаИзмерения;  
			
		КонецЕсли;
	КонецЦикла;
	
	Объект.ТЧ.Очистить();
	
	Для каждого СтрокаТЗ из ТЗ Цикл
		
		СтрокаТаблицыПриемника = Объект.ТЧ.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаТаблицыПриемника, СтрокаТЗ);
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура Заполнить(Команда)
	ЗаполнитьНаСервере();
КонецПроцедуры
