
&НаКлиенте
Процедура Старт(Команда)
	
	Для каждого элемент из ПолучитьНаименНоменклатураВМассив() Цикл 
		Для каждого подЭлемент из элемент Цикл 
			Сообщить(подЭлемент);	
		КонецЦикла
	КонецЦикла
	
КонецПроцедуры

&НаСервере
Функция ПолучитьНаименНоменклатураВМассив()
	
	Номенклатура = Справочники.Номенклатура.Выбрать();
	НоменклатураНаименования = Новый Массив(3, 7);
	Индекс = 0;
	
	Пока Номенклатура.Следующий() Цикл
		НоменклатураНаименования[0][Индекс] = Номенклатура.Код;
		НоменклатураНаименования[1][Индекс] = Номенклатура.Наименование;
		Индекс = Индекс + 1;
	КонецЦикла;            
	
	НоменклатураНаименования[1].Удалить(0);
	
	Возврат НоменклатураНаименования;
	
КонецФункции                